spec/support/vcr_cassettes/bgs/base/create_person.yml

---
http_interactions:
- request:
    method: get
    uri: https://localhost:4447/VnpPersonWebServiceBean/VnpPersonService?WSDL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Host:
      - ".vba.va.gov"
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 26 May 2020 16:00:00 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml;charset=utf-8
    body:
      encoding: UTF-8
      string: |-
        <?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Oracle JAX-WS 2.1.5. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Oracle JAX-WS 2.1.5. --><definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://personService.services.vonapp.vba.va.gov/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://personService.services.vonapp.vba.va.gov/" name="VnpPersonService">
        <types>
        <xsd:schema>
        <xsd:import namespace="http://personService.services.vonapp.vba.va.gov/" schemaLocation="http://linktestbepbenefits.vba.va.gov:80/VnpPersonWebServiceBean/VnpPersonService?xsd=1"/>
        </xsd:schema>
        </types>
        <message name="vnpPersonUpdate">
        <part name="parameters" element="tns:vnpPersonUpdate"/>
        </message>
        <message name="vnpPersonUpdateResponse">
        <part name="parameters" element="tns:vnpPersonUpdateResponse"/>
        </message>
        <message name="MessageFaultException">
        <part name="fault" element="tns:MessageFaultException"/>
        </message>
        <message name="vnpPersonCreate">
        <part name="parameters" element="tns:vnpPersonCreate"/>
        </message>
        <message name="vnpPersonCreateResponse">
        <part name="parameters" element="tns:vnpPersonCreateResponse"/>
        </message>
        <message name="vnpPersonRemove">
        <part name="parameters" element="tns:vnpPersonRemove"/>
        </message>
        <message name="vnpPersonRemoveResponse">
        <part name="parameters" element="tns:vnpPersonRemoveResponse"/>
        </message>
        <message name="findAllAsArray">
        <part name="parameters" element="tns:findAllAsArray"/>
        </message>
        <message name="findAllAsArrayResponse">
        <part name="parameters" element="tns:findAllAsArrayResponse"/>
        </message>
        <message name="vnpPersonFindByPrimaryKey">
        <part name="parameters" element="tns:vnpPersonFindByPrimaryKey"/>
        </message>
        <message name="vnpPersonFindByPrimaryKeyResponse">
        <part name="parameters" element="tns:vnpPersonFindByPrimaryKeyResponse"/>
        </message>
        <portType name="VnpPersonService">
        <operation name="vnpPersonUpdate">
        <input message="tns:vnpPersonUpdate"/>
        <output message="tns:vnpPersonUpdateResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        <operation name="vnpPersonCreate">
        <input message="tns:vnpPersonCreate"/>
        <output message="tns:vnpPersonCreateResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        <operation name="vnpPersonRemove">
        <input message="tns:vnpPersonRemove"/>
        <output message="tns:vnpPersonRemoveResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        <operation name="findAllAsArray">
        <input message="tns:findAllAsArray"/>
        <output message="tns:findAllAsArrayResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        <operation name="vnpPersonFindByPrimaryKey">
        <input message="tns:vnpPersonFindByPrimaryKey"/>
        <output message="tns:vnpPersonFindByPrimaryKeyResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        </portType>
        <binding name="VnpPersonServicePortBinding" type="tns:VnpPersonService">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="vnpPersonUpdate">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPersonCreate">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPersonRemove">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="findAllAsArray">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPersonFindByPrimaryKey">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        </binding>
        <service name="VnpPersonService">
        <port name="VnpPersonServicePort" binding="tns:VnpPersonServicePortBinding">
        <soap:address location="http://linktestbepbenefits.vba.va.gov:80/VnpPersonWebServiceBean/VnpPersonService"/>
        </port>
        </service>
        </definitions>
    http_version: null
  recorded_at: Tue, 26 May 2020 16:00:01 GMT
- request:
    method: post
    uri: http://linktestbepbenefits.vba.va.gov/VnpPersonWebServiceBean/VnpPersonService
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://personService.services.vonapp.vba.va.gov/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
          <wsse:UsernameToken>
            <wsse:Username>VAgovAPI</wsse:Username>
          </wsse:UsernameToken>
          <vaws:VaServiceHeaders xmlns:vaws="http://vbawebservices.vba.va.gov/vawss">
            <vaws:CLIENT_MACHINE>192.168.1.239</vaws:CLIENT_MACHINE>
            <vaws:STN_ID>281</vaws:STN_ID>
            <vaws:applicationName>VAgovAPI</vaws:applicationName>
            <vaws:ExternalUid>43303684993129005</vaws:ExternalUid>
            <vaws:ExternalKey>abraham.lincoln@vets.gov</vaws:ExternalKey>
          </vaws:VaServiceHeaders>
        </wsse:Security>
        </env:Header><env:Body><tns:vnpPersonCreate><arg0><vnpPtcpntId>147891</vnpPtcpntId><birthCityNm xsi:nil="true"/><birthStateCd>FL</birthStateCd><birthCntryNm xsi:nil="true"/><brthdyDt>07/04/1969</brthdyDt><cmptnyDecnTypeCd xsi:nil="true"/><depNbr xsi:nil="true"/><empInd xsi:nil="true"/><entlmtTypeCd xsi:nil="true"/><ethnicTypeCd xsi:nil="true"/><everMariedInd xsi:nil="true"/><fidDecnCategyTypeCd xsi:nil="true"/><fileNbr>12345</fileNbr><firstNm>vet first name</firstNm><firstNmKey xsi:nil="true"/><frgnSvcNbr xsi:nil="true"/><genderCd xsi:nil="true"/><jrnDt>2020-05-26T16:00:00Z</jrnDt><jrnLctnId>281</jrnLctnId><jrnObjId>VAgovAPI</jrnObjId><jrnStatusTypeCd>U</jrnStatusTypeCd><jrnSserId>VAgovAPI</jrnSserId><lastNm>vet last name</lastNm><lastNmKey xsi:nil="true"/><lgyEntlmtTypeCd xsi:nil="true"/><martlStatusTypeCd xsi:nil="true"/><middleNm>vet middle name</middleNm><mltyPersonInd xsi:nil="true"/><monthsPresntEmplyrNbr xsi:nil="true"/><netWorthAmt xsi:nil="true"/><noSsnReasonTypeCd xsi:nil="true"/><ocptnTxt xsi:nil="true"/><personDeathCauseTypeNm xsi:nil="true"/><personTypeNm xsi:nil="true"/><potntlDngrsInd xsi:nil="true"/><raceTypeNm xsi:nil="true"/><serousEmplmtHndcapInd xsi:nil="true"/><slttnTypeNm xsi:nil="true"/><spinaBifidaInd xsi:nil="true"/><ssnNbr>123341234</ssnNbr><ssnVrfctnStatusTypeCd xsi:nil="true"/><suffixNm>Jr</suffixNm><taxAbtmntCd xsi:nil="true"/><termnlDigitNbr xsi:nil="true"/><titleTxt xsi:nil="true"/><vetInd>Y</vetInd><vetTypeNm xsi:nil="true"/><yearsPresntEmplyrNbr xsi:nil="true"/><vnpProcId>3828728</vnpProcId><vnpSruslyDsabldInd xsi:nil="true"/><vnpSchoolChildInd xsi:nil="true"/><deathDt>01/01/2020</deathDt></arg0></tns:vnpPersonCreate></env:Body></env:Envelope>
    headers:
      Host:
      - ".vba.va.gov"
      Soapaction:
      - '"vnpPersonCreate"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '2585'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx/1.17.9
      Date:
      - Tue, 26 May 2020 16:00:02 GMT
      Content-Type:
      - text/xml; charset=utf-8
      Content-Length:
      - '1973'
      Connection:
      - keep-alive
      X-Frame-Options:
      - SAMEORIGIN
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><work:WorkContext
        xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXdKABR3ZWJsb2dpYy5hcHAudm5wLWVhcgAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQABTIuMC44AAA=</work:WorkContext></S:Header><S:Body><ns2:vnpPersonCreateResponse
        xmlns:ns2="http://personService.services.vonapp.vba.va.gov/"><return><vnpPtcpntId>147891</vnpPtcpntId><birthCityNm></birthCityNm><birthStateCd>FL</birthStateCd><birthCntryNm></birthCntryNm><cmptnyDecnTypeCd></cmptnyDecnTypeCd><depNbr>0</depNbr><empInd></empInd><entlmtTypeCd></entlmtTypeCd><ethnicTypeCd></ethnicTypeCd><everMariedInd></everMariedInd><fidDecnCategyTypeCd></fidDecnCategyTypeCd><fileNbr>12345</fileNbr><firstNm>vet
        first name</firstNm><frgnSvcNbr>0</frgnSvcNbr><genderCd></genderCd><jrnDt>2020-05-26T11:00:00-05:00</jrnDt><jrnLctnId>281</jrnLctnId><jrnObjId>VAgovAPI</jrnObjId><jrnStatusTypeCd>U</jrnStatusTypeCd><lastNm>vet
        last name</lastNm><lgyEntlmtTypeCd></lgyEntlmtTypeCd><martlStatusTypeCd></martlStatusTypeCd><middleNm>vet
        middle name</middleNm><mltyPersonInd></mltyPersonInd><monthsPresntEmplyrNbr>0</monthsPresntEmplyrNbr><netWorthAmt>0</netWorthAmt><noSsnReasonTypeCd></noSsnReasonTypeCd><ocptnTxt></ocptnTxt><personDeathCauseTypeNm></personDeathCauseTypeNm><personTypeNm></personTypeNm><potntlDngrsInd></potntlDngrsInd><raceTypeNm></raceTypeNm><serousEmplmtHndcapInd></serousEmplmtHndcapInd><slttnTypeNm></slttnTypeNm><spinaBifidaInd></spinaBifidaInd><ssnNbr>123341234</ssnNbr><ssnVrfctnStatusTypeCd></ssnVrfctnStatusTypeCd><suffixNm>Jr</suffixNm><taxAbtmntCd></taxAbtmntCd><termnlDigitNbr></termnlDigitNbr><titleTxt></titleTxt><vetInd>Y</vetInd><vetTypeNm></vetTypeNm><yearsPresntEmplyrNbr>0</yearsPresntEmplyrNbr><vnpProcId>3828728</vnpProcId><vnpSruslyDsabldInd></vnpSruslyDsabldInd><vnpSchoolChildInd></vnpSchoolChildInd></return></ns2:vnpPersonCreateResponse></S:Body></S:Envelope>
    http_version: null
  recorded_at: Tue, 26 May 2020 16:00:02 GMT
recorded_with: VCR 5.1.0
